src/loadtest/artillery/test2.yml
config:
  target: 'http://localhost:8082'
  phases:
    - duration: 5  # Duration of the test in seconds
      arrivalRate: 10  # Number of new virtual users created per second
      rampTo: 50  # Gradually ramp up the number of users
  defaults:
    headers:
      Content-Type: application/json

  processor: "./functions.js"

scenarios:
  - flow:
      - function: "getParams"
      - get:
          url: "/external/v1/account-payment/mode"
          headers:
            Authorization: "{{ token }}"
          qs:
            num: "{{ num }}"
            pId: "{{ pId }}"